[
    {
        "titulo": "Trump promises 'expedited' process for Nvidia's US supercomputer plans as Big Tech pledges top $1.6 trillion",
        "fecha": "Tue, Apr 15, 2025, 11:39 AM",
        "url": "https://finance.yahoo.com/news/trump-promises-expedited-process-for-nvidias-us-supercomputer-plans-as-big-tech-pledges-top-16-trillion-173943856.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nPresident Trump on Tuesday again toutedNvidia’s $500 billion commitmentto building AI infrastructure in the US, pledging to expedite the process for the chip giant and any other company planning big US investments.\n“This is very big and exciting news. All necessary permits will be expedited and quickly delivered to NVIDIA, as they will to all companies committing to be part of the Golden Age of America!” Trump said in a Truth Social post.\nNvidia's announcement brings Big Tech’s investment pledges to US AI infrastructure to just north of $1.6 trillion since Trump's inauguration as thetech world tries to navigate the potential hazards of the president's trade war while staying on the right side of a malleable administration.\nNvidia, for its part, did seem to make moves in US manufacturing partially due to Trump’s chaotic approach to trade policy, with on-again, off-again global tariffs affecting imports of AI servers containing its highly coveted GPUs, or graphics processing units.\nAsked about Trump’s tariffs at its annual GTC event in March, Nvidia CEO Jensen Huang said the company was \"preparing, and we have been preparing to manufacture onshore.\" Huangreportedly attended a dinner at Mar-a-Lagolast week, after which the Trump administration backed off new restrictions on the company's chip exports to China.\nNvidia's moves are the latest in Big Tech's splashy announcements of plans to expand investments within the US.\nIn February, Apple (AAPL)committed to investing $500 billion to expand its US manufacturingover the next four years.\nTSMC (TSM) — which makes the world's most advanced chips with most of its manufacturing capacity in Taiwan —has committed to spending $100 billionover a similar time frame. The company had previously committed $65 billion to building out its US manufacturing capabilities with funding from the 2022 Chips and Science Act.\nJust after Trump's inauguration, Oracle (ORCL), OpenAI (OPAI.PVT), and SoftBank (SFTBY) announceda joint venture called Stargate, which the companies said would spend $500 billion on US AI data centers.\nAnd after Trump's election, Microsoft (MSFT) said it wouldspend $80 billion to build AI data centers. The company said \"more than half\" of that total would be invested in the US.\nApple's US-centric moves have landed in the spotlight again amid Trump's fluctuating tariff policies. Apple announced its $500 billion commitment just days afterTrump said CEO Tim Cookpromised him hundreds of millions of dollars in US investment and implied the pledge was due to his approach to trade policy.\n\"They don't want to be in the tariffs,\" Trump said in February.\nHowever,it’s unclear how much of Apple’s commitment will be from new investments, given that the spending announced was in line with its prior capital expenditures.\nNevertheless, Trump's relationship with Cook has weaved its way into tariff developments in the past several days. US Customs and Border Protectionissued regulations late Fridayexempting consumer electronics, networking equipment, and computing products — including GPUs and servers — from reciprocal tariffs.\nThat includes Trump's ever-ballooning 145% levies on China, where Apple still does most of its production. Trump boasted Monday that he \"helped Tim Cook recently.\"\n\"I don't want to hurt anybody, but the end result is we're going to get to the position of greatness for our country,\" he said.\nBut Trump also set the stage to impose tariffs on semiconductors Tuesday —the Commerce Department opened a probe into computer chips under Section 232 of the Trade Expansion Act of 1962, which grants the president the authority to impose tariffs on imports seen as essential to national security. And he has promised that most electronics will still get wrapped up in his tariffs.\n\"We are taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Security Tariff Investigations,\" he posted Sunday.\nLaura Bratton is a reporter for Yahoo Finance. Follow her on X@LauraBratton5.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "titulo": "The trade war uncovers new economies of scale: Morning Brief",
        "fecha": "Tue, Apr 15, 2025, 6:00 AM",
        "url": "https://finance.yahoo.com/news/the-trade-war-uncovers-new-economies-of-scale-morning-brief-100042287.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nThis is The Takeaway from today's Morning Brief, which you cansign upto receive in your inbox every morning along with:\nThe chart of the day\nWhat we're watching\nWhat we're reading\nEconomic data releases and earnings\nIt pays to be big.\nThat's one early takeaway from the tariff drama. Investors momentarilypoured back into Big Techafter the administration initiateda temporary levy exemptionthat covers consumer electronics, networking equipment, GPUs, and servers.\nIt's essentially another way of saying that Big Tech will probably be OK, as investors alsolook to the sector as a defensive play. Meanwhile, other sectors and companies still stare down amassive tariff upheaval.\nBy subscribing, you are agreeing to Yahoo'sTermsandPrivacy Policy\nIt's a feature of American politics to want to avoid the appearance of picking winners and losers in the market. That phrase is often used as a rhetorical cudgel to attack opponents as bad for the economy.\nBut one person's favoritism is another's industrial policy.\nIf the market is consumed by the repercussions of tariffs, exemptions to those taxes can mean everything.The potential special carve-outs for tech, however, initially sparked a rally on Monday, fizzled, then rebounded. Part of this confused response from investors was the White Houseseemingly sending mixed signals.\nAfter the exclusions from reciprocal tariffs were first unveiled, the president said in a social media post \"there was no Tariff 'exception' announced.\" He later told reporters that his goal was encouraging production to move to the US but added that the administration has to show flexibility.\nThe tech titans hoping to receive assistance from the White House are showing flexibility too, or rathera willingness to support the president's agendaof bolstering domestic manufacturing and investment.\nNvidia (NVDA) on Monday said it willproduce up to $500 billion of AI infrastructurein the US within the next four years. That announcement follows other Big Tech commitments from Apple (AAPL), Microsoft (MSFT), and Meta (META) to spend in the US.\nRecent trading sessions with wild upward swings have made one thing clear: Pronouncements on tariffs arethe only meaningful catalyst for stocksin this uncertain moment.\nThat goes for Big Tech too, whose trillion-dollar tickers are buoyed by global supply chains and customer bases all around the world. It's true that their size and market heft might allow these companies to weather whatever tariff costs come. But people are intimately familiar with how much, say, a phone costs, making a sudden upcharge on a finished product an unsavory consumer experience. It is, perhaps, the modern price of bread.\nOverall, the dizzying tariff news, Wedbush analyst Dan Ives said in a note to clients, is \"a step forward net positive for Apple as well as other tech names.\" It creates the space for some sort of negotiation with China, he said, and can lead to a deescalation of the trade war issues that have left Big Tech caught in the middle.\nTheir importance for American tech supremacy means, in a way, they are too important to fail, and the value they bring to the stock market makes the rest of the S&P seem like lesser moons in a solar system that revolves around them.\nBut in this chaotic environment, the most important distinction of all isn't size alone; it's a tariff carve-out.\nHamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on X@hshaban.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance"
    },
    {
        "titulo": "Here's Why Apple (AAPL) Fell More Than Broader Market",
        "fecha": "Tue, Apr 15, 2025, 5:45 PM",
        "url": "https://finance.yahoo.com/news/heres-why-apple-aapl-fell-214514111.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL) closed the latest trading day at $202.14, indicating a -0.19% change from the previous session's end. This change lagged the S&P 500's daily loss of 0.17%. Elsewhere, the Dow saw a downswing of 0.39%, while the tech-heavy Nasdaq depreciated by 0.05%.\nThe maker of iPhones, iPads and other products's shares have seen a decrease of 5.36% over the last month, surpassing the Computer and Technology sector's loss of 6.26% and falling behind the S&P 500's loss of 3.94%.\nMarket participants will be closely following the financial results of Apple in its upcoming release. The company plans to announce its earnings on May 1, 2025. The company is forecasted to report an EPS of $1.60, showcasing a 4.58% upward movement from the corresponding quarter of the prior year. Meanwhile, our latest consensus estimate is calling for revenue of $93.5 billion, up 3.03% from the prior-year quarter.\nFor the full year, the Zacks Consensus Estimates project earnings of $7.20 per share and a revenue of $404.46 billion, demonstrating changes of +6.67% and +3.43%, respectively, from the preceding year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Apple. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.85% lower. Apple is currently sporting a Zacks Rank of #3 (Hold).\nInvestors should also note Apple's current valuation metrics, including its Forward P/E ratio of 28.12. This expresses a premium compared to the average Forward P/E of 8.99 of its industry.\nIt's also important to note that AAPL currently trades at a PEG ratio of 2.14. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. As of the close of trade yesterday, the Computer - Micro Computers industry held an average PEG ratio of 1.46.\nThe Computer - Micro Computers industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 85, which puts it in the top 35% of all 250+ industries.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nTo follow AAPL in the coming trading sessions, be sure to utilize Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research"
    },
    {
        "titulo": "When Apple's Tim Cook Revealed The Real Reason iPhones Are Made In China—And It's Not 'Low Labor Costs': 'China Stopped Being A Low-Wage Country Years Ago'",
        "fecha": "Tue, Apr 15, 2025, 5:31 PM",
        "url": "https://finance.yahoo.com/news/apples-tim-cook-revealed-real-213129145.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple Inc.(NASDAQ:AAPL) CEOTim Cookpreviously explained the company’s decision to continue manufacturing its products in China, refuting the widespread belief that it’s due to low labor costs.\nWhat Happened: A 2024 video of Tim Cook has resurfaced, providing insights into Apple’s manufacturing choices amid the ongoing U.S.-China tariff war. In the video, posted on X by CNBC TV18 reporter Nigel D’Souza, Cook dismissed the idea that Apple’s manufacturing in China is due to low labor costs, stating, “China stopped being a low labor cost company many years ago.”\nTrending: ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company allows users to earn money on their phones.You can invest today for just $0.26/share with a $1000 minimum.\nInstead, he emphasized China’s unparalleled skilled labor concentration in one location and advanced tooling capabilities as the primary reason. Cook emphasized that “the products that we do require truly advanced tooling.”\n\nOn that note, Cook emphasized the sharp difference in vocational skills between the US and China. The Apple CEO stated, \"In the US, you could have a meeting of tooling engineers, and I’m not we could fill the room.\" In China, however, \"you could fill multiple football fields.... Hence, the vocational expertise in China is very deep”.\nWhy It Matters: The U.S.-China tariff war has put pressure on American companies to shift production back home. Earlier this month, a leading tech analyst predicted asignificant price hikefor Apple iPhones if manufacturing shifts to the U.S., potentially reaching around $3,500. This is due to the complexity of recreating the production ecosystem that currently exists in Asia.\nSee Also: Maker of the $60,000 foldable home has 3 factory buildings, 600+ houses built, and big plans to solve housing —this is your last chance to become an investor for $0.80 per share.\nFurthermore, experts opined that Apple’s supply chain could face major disruptions due to new reciprocal tariffs. Apple had temporarily dodged steep tariffs on Chinese-made electronics following an exemption granted by Trump.\nA recent report also suggested that Apple completed an urgent logistics operation, transporting five planeloads of iPhones and other products from manufacturing centers in India and China to the U.S. within 72 hours, in a bid to beat PresidentDonald Trump's new 10% reciprocal tariff on imports.\nGiven these complexities, Cook’s emphasis on China’s skilled labor and advanced tooling capabilities provides a clearer understanding of Apple’s manufacturing decisions.\nApple has lost over $500 billion in market capitalization since the Apr 2 ‘Liberation Day’ tariffs. On Friday, the stock climbed 4.06% to close at $198.15, as perBenzinga Pro.\nApple holds a momentum rating of 62.11% and a quality rating of 86.50%, according toBenzinga's Proprietary Edge Rankings. For an in-depth report on more stocks and insights into growth opportunities,signup for Benzinga Edge.\nRead Next:\nAre you rich?Here’s what Americans think you need to be considered wealthy.\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\"Here’s how you can earn passive income with just $100.\nImage via Shutterstock\nDisclaimer:This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nSend To MSN:  Send to MSN\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools.Click now to access unique insightsthat can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga?\nThis articleWhen Apple's Tim Cook Revealed The Real Reason iPhones Are Made In China—And It's Not 'Low Labor Costs': 'China Stopped Being A Low-Wage Country Years Ago'originally appeared onBenzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    },
    {
        "titulo": "Is Apple Inc. (AAPL) The Best American Tech Stock to Buy Now?",
        "fecha": "Tue, Apr 15, 2025, 4:08 PM",
        "url": "https://finance.yahoo.com/news/apple-inc-aapl-best-american-200819194.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently compiled a list of the14 Best American Tech Stocks To Buy Now. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other American tech stocks.\nAmerican stocks moved up a bit on Monday, April 14 as investors focused on news about tech companies getting a break from President Trump’s tariffs. The S&P 500 rose by 0.8%, the tech-heavy Nasdaq rose by 0.6%, and the Dow Jones Industrial Average increased by about 0.7%.\nREAD ALSO:11 Best American Energy Stocks to Buy Nowand10 Best Stocks Under $10 to Buy Now.\nIn recent days, President Trump and his advisers have given mixed signals on the future of tariffs on China and on specific industries. Over the weekend, big American tech companies scored a victory when it was revealed that the US had not put tariffs on smartphones, computers, and other consumer electronics.\nHowever, on Sunday, US Commerce Secretary Howard Lutnick stated that these electronics would soon be covered under new tariffs, which would be different from those imposed on specific countries. President Trump also posted on social media that there would be “no exception” for these products. He also said that the government is looking at semiconductors and the entire electronics supply chain in the upcoming National Security Tariff Investigations.\nLast week was the best week for the major indexes since at least 2023. However, with all this uncertainty, Wall Street is getting ready for another week of potential tariff-fueled ups and downs.\nTo compile our list of the 14 best American tech stocks to buy now, we used stock screeners from Finviz and Yahoo Finance to find the largest American technology companies. We sorted our results based on market capitalization and picked the top 30 American stocks. Next, we focused on the 14 stocks most favored by institutional investors. Data for the hedge fund sentiment surrounding each stock was taken from Insider Monkey’s Q4 2024 database of more than 1,000 elite hedge funds. Finally, the 14 best American tech stocks to buy now were ranked in ascending order based on the number of hedge funds holding stakes in them as of Q4 2024.\nWhy do we care about what hedge funds do? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter's strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Holders: 166\nApple Inc. (NASDAQ:AAPL) is an American multinational technology company that designs, manufactures, and markets consumer electronics, software, and services. The company is best known for its products like the iPhone, iPad, and Mac computers, as well as services such as the App Store, iCloud, and Apple Pay. Apple Inc. (NASDAQ:AAPL) ranks among the best American stocks to invest in.\nOn April 9, Jefferies upgraded Apple Inc. (NASDAQ:AAPL) from “Underperform” to “Hold” but lowered the price target to $167.88 from the previous $202.33. This adjustment reflects concerns about the potential impacts of a global recession on iPhone demand and the expected price increases for future iPhone models. The analyst noted that Apple Inc. (NASDAQ:AAPL) is expected to be exempted from US tariffs because of its commitment to invest $500 billion in the US over the next four years. The analyst believes that the company will make further investments in US manufacturing, possibly including iPhone production. Despite this, a growing risk of a global recession could have a negative impact on iPhone demand. Jefferies has lowered its iPhone shipment forecasts by 3.6%, 7.7%, and 5.5% for fiscal years 2025, 2026, and 2027 respectively, which leads to a reduction in projected revenue by 2%, 4.1%, and 3.5% for the same fiscal years. The firm anticipates that Apple Inc. (NASDAQ:AAPL) will raise iPhone prices by $50 in 2026 for the iPhone 18 and by $100 in 2027 for the iPhone 19. These increases in price are expected to be mainly driven by higher hardware costs. Following these revisions, Jefferies now estimates earnings per share (EPS) estimates for Apple Inc. (NASDAQ:AAPL) lower than market consensus by 2.5%, 8.5%, and 3.4% for fiscal years 2025, 2026, and 2027, respectively.\nOverall, AAPLranks 6thon our list of the best American tech stocks to buy now. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock.\nREAD NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published atInsider Monkey."
    },
    {
        "titulo": "Stocks making big moves yesterday: Apple (AAPL) and Palantir (PLTR)",
        "fecha": "Tue, Apr 15, 2025, 3:45 PM",
        "url": "https://finance.yahoo.com/news/stocks-making-big-moves-yesterday-194501169.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (NASDAQ:AAPL):iPhone and iPad maker Apple (NASDAQ:AAPL) rose by 6.5% on Monday after reports indicated that smartphones, computers, and a wide range of tech devices and components would be exempt from the reciprocal tariffs on U.S. imports announced on April 2, 2025.See our full article here.\nIs now the time to buy Apple?Access our full analysis report here, it’s free.\nPalantir (NASDAQ:PLTR):Data-mining and analytics company Palantir (NYSE:PLTR) rose by 8.4% on Monday after NATO acquired the company's (PLTR's) AI-powered Maven Smart System to improve its military capabilities.See our full article here.\nIs now the time to buy Palantir?Access our full analysis report here, it’s free."
    },
    {
        "titulo": "Apple Rallies After Dodging Tariffs, Wins Analyst Nod",
        "fecha": "Tue, Apr 15, 2025, 3:04 PM",
        "url": "https://finance.yahoo.com/news/apple-rallies-dodging-tariffs-wins-190437884.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL,Financials) shares climbed about 2% to close at $202.52 on Monday after KeyBancupgraded the stock, citing the company's exemption from a new round of U.S. tariffs on tech imports.\nThe firm raised its rating on Apple to sector weight from underweight following the Trump administration's decision to exclude smartphones, computers, and other electronics from the latest reciprocal tariffs. KeyBanc analyst Brandon Nispel said in a note that the decision significantly reduces the downside risk from a prolonged trade conflict between the United States and China.\nCiti maintained its outperform rating on Apple but lowered its sales projections for iPhones, Macs, and wearables. The bank cited expectations of a global economic slowdown due to the broader impact of tariffs, even as Apple's core products received exemptions. According to Citi, Apple remains vulnerable to weakening macroeconomic conditions.\nCommerce Secretary Howard Lutnick said Sunday that the tariff exemption is not permanent and that the administration could introduce new tariffs within the next two months. That raises questions about how long the trade relief will benefit Apple and other tech companies.\nWedbush, which also has an outperform rating on the stock, said the temporary nature of the exemption creates space for potential negotiations between the United States and China. The firm noted that Apple and other major tech companies are closely watching for any developments that could renew trade tensions.\nDespite the recent gains, Apple shares are down nearly 20% since the start of the year.\nThis article first appeared onGuruFocus."
    },
    {
        "titulo": "Apple Bets Big on Samsung for Its First Foldable iPhone",
        "fecha": "Tue, Apr 15, 2025, 2:56 PM",
        "url": "https://finance.yahoo.com/news/apple-bets-big-samsung-first-185632294.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nAfter years of teasing the idea, Apple (NASDAQ:AAPL) isfinallymoving closer to launching its first foldable iPhoneand it's putting all its display chips on one bet. Sources say Apple has chosen Samsung Display as the exclusive supplier for the foldable OLED panels, citing Samsung's (SSNLF) technical lead in minimizing screen creasesarguably the make-or-break feature of a folding phone. Mass production is expected to kick off by late 2025 or early 2026, covering a 7.8-inch main display and a 5.5-inch external screen. For investors, this marks a rare moment when Apple ditches its usual playbook of sourcing from multiple suppliers to drive competition.\nWhat's striking is who's not on that list: LG Display. Despite being one of Apple's earliest partners in foldable tech, even co-developing prototype panels back in 2016 and forming a dedicated task force in 2017, LG is now sitting on the sidelines. While Apple's history suggests it could bring in LG for future models if sales scale, this first foldable looks like a one-brand show. The move underscores just how high the bar isand how dominant Samsung's foldable portfolio has become in the premium OLED space.\nFor Samsung Display, this deal isn't just about unitsit's about locking in pole position in the next-gen smartphone race. Apple's validation sends a strong signal to the market that Samsung's tech is years ahead when it comes to crease control and panel reliability. If the iPhone Fold takes off, expect this to be the start of a deeper AppleSamsung hardware alignmentand possibly a wake-up call for LG and BOE to rethink their roadmap.\nThis article first appeared onGuruFocus."
    },
    {
        "titulo": "Apple Dodged a Bullet, but the Stock Still Isn't a Buy",
        "fecha": "Tue, Apr 15, 2025, 1:25 PM",
        "url": "https://finance.yahoo.com/news/apple-dodged-bullet-stock-still-172500007.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nTo the relief of anyone with an aging iPhone, the Trump administration exempted smartphones, computers, and other tech products from its punishing tariffs on Chinese imports over the weekend. WhileApple(NASDAQ: AAPL)has geographically diversified its supply chain, the company still relies heavily on Chinese manufacturing partners for its devices. Absent any special treatment, prices in the U.S. on Apple products would have likely risen substantially due to the tariffs.\nWhile Apple is getting a big break, the relief may be short lived. President Trump later clarified that electronics like Apple's iPhones would be moving into a different tariff \"bucket.\" While Apple's devices may not be subject to the full tariff on Chinese imports, they may eventually be subject to some level of tariffs.\nEven if Apple somehow manages to avoid tariffs on its own products, the escalating trade war between the U.S. and China, along with the uncertainty created by the Trump administration's generaltariff policy, could hurt the company in another way.\nWhile predicting anything about the economy right now is tough, the odds of an economic downturn certainly appear to be rising as businesses and consumers cope with the impact of unpredictable and ever-changing tariffs. Consumer confidence plunged in March, according to The Conference Board, and consumers' short-term expectations regarding economic conditions reached their lowest level in 12 years. These drops were recorded before the Trump administration announced its reciprocal tariffs, which led to a sharp stock market plunge.\nSmartphones are an essential item for nearly everyone, but purchases can also be easily deferred. The replacement cycles for smartphones and other electronic devices have been lengthening already, and this effect could go into overdrive during a recession. If smartphones also become more expensive due to tariffs, the replacement cycle could lengthen further.\nApple Intelligence, Apple's take onAI-powered featuresfor its devices, probably won't save the day and induce many iPhone users to upgrade. Apple is reportedly having all sorts of problems with a revamped version of Siri, which raises questions about when the promised AI features will arrive and how useful they will be.\nNew hardware probably won't help, either. The smartphone market is mature, and annual upgrades don't introduce much more than slightly better performance or other modest improvements. Without a good reason to upgrade, it won't be much of a sacrifice for consumers to kick the can down the road during a recession.\nDespite iPhone sales flatlining and the tariff uncertainty, Apple stock trades for around 28 times the average analyst estimate for fiscal 2025. Analysts are still assuming, by the way, that Apple will manage to grow earnings significantly this year. That forecast could turn out to be overly optimistic depending on how the tariff situation plays out.\nI'm not convinced Apple stock deserves that kind of valuation, given all the headwinds facing the company. The iPhone business was already struggling to grow, and an economic slowdown isn't going to help matters. Even if Apple manages to stay out of the tariff crosshairs, sales and profits look likely to take a hit this year. Given the risks, Apple stock looks too expensive.\nBefore you buy stock in Apple, consider this:\nTheMotley Fool Stock Advisoranalyst team just identified what they believe are the10 best stocksfor investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider whenNetflixmade this list on December 17, 2004... if you invested $1,000 at the time of our recommendation,you’d have $502,231!*Or whenNvidiamade this list on April 15, 2005... if you invested $1,000 at the time of our recommendation,you’d have $678,552!*\nNow, it’s worth notingStock Advisor’s total average return is800% — a market-crushing outperformance compared to156%for the S&P 500. Don’t miss out on the latest top 10 list, available when you joinStock Advisor.\nSee the 10 stocks »\n*Stock Advisor returns as of April 14, 2025\nTimothy Greenhas no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple. The Motley Fool has adisclosure policy.\nApple Dodged a Bullet, but the Stock Still Isn't a Buywas originally published by The Motley Fool"
    },
    {
        "titulo": "US tariffs: Can Apple manufacture in the US?",
        "fecha": "Tue, Apr 15, 2025, 1:23 PM",
        "url": "https://finance.yahoo.com/news/us-tariffs-apple-manufacture-us-172358275.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nOn April 11, 2025, just days after announcing new tariffs, the Trump administration exempted smartphones, laptops, processors, displays, and memory chips from tariffs, only to later clarify that this was a temporary reprieve.\nThe US government is set to reassess the entire consumer electronics supply chain amid an investigation into semiconductors, which may soon face tariffs. Earlier last week, the president also announced a 90-day suspension of ‘reciprocal’ tariffs for most trading partners. Concurrently, Trump raised tariffs on Chinese imports to an unprecedented 145%. This indicates a strong push for US production of consumer devices, including Apple iPhones. The pressing question is whether Apple can manufacture its products domestically.\nManufacturing Apple devices in the US is possible but would require significant investment and effort from Apple and governmental bodies, both present and future, with years of business disruption in between.\nChina has developed a robust consumer electronics ecosystem over decades, with a vast network of suppliers, skilled labor, efficient infrastructure, and ample production sites. Consequently, more than half of Apple’s 200 global suppliers are based in China, where a skilled workforce and favourable conditions for large-scale manufacturing exist.\nReplicating this in the US would necessitate attracting skilled labour, reforming educational pathways, and fostering a culture that values higher education—actions that are not currently aligned with the administration's policies, as evidenced by the recent immigration uproar and the gutting of the US Department of Education. These tariffs, therefore, appear to be geopolitical trade instruments plainly intended to secure more advantageous agreements.\nIf Apple cannot secure long-term tariff exemptions, then the cost of its devices will likely rise.\nCurrently, 80% of Apple’s overall products are assembled in China, and a 145% tariff could increase the price of an iPhone 16 Pro Max to more than $2,600. Apple has begun diversifying production to India and Vietnam, moving about 15-20% of its production there, but remains heavily reliant on China, where 90% of iPhones are still assembled.\nIn the meantime, Apple is stockpiling millions of iPhones, with reports of five planeloads of phones and accessories flying into the US from India in the three days following the April 2 tariff communication. However, the upcoming iPhone 17 series, produced in China, may face tariffs, complicating pricing strategies and potentially dampening consumer demand.\nApple faces a potential crisis. Should the company be compelled to shift production to the US, it will encounter insurmountable challenges in meeting its current scale of shipments. The company is at risk of a supply-demand imbalance if forced to shift production to the US, which could lead to higher prices and lost sales.\nApple's challenges are compounded in China, its third largest market, by growing negative American sentiment and competition from local Chinese manufacturers like Huawei and Vivo, which are gaining market share due to their technological advancements, as well as their progressiveness in AI. Additionally, rival Samsung's diversified supply chain – spread across Vietnam, India, Brazil, Indonesia, and South Korea – gives it a competitive edge, as the company is less over exposed to China compared with Apple.\nSuffice it to say that Apple has not faced a crisis of this magnitude since its potential bankruptcy in 1997.\n\"US tariffs: Can Apple manufacture in the US?\" was originally created and published byVerdict, a GlobalData owned brand.\n\n\nThe information on this site has been included in good faith for general informational purposes only. It is not intended to amount to advice on which you should rely, and we give no representation, warranty or guarantee, whether express or implied as to its accuracy or completeness. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site."
    },
    {
        "titulo": "Apple (NasdaqGS:AAPL) Sees 12% Price Increase Over Last Week",
        "fecha": "Tue, Apr 15, 2025, 1:22 PM",
        "url": "https://finance.yahoo.com/news/apple-nasdaqgs-aapl-sees-12-172245106.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApplesaw a notable price increase of 12% over the last week, likely buoyed by the integration announcement of Cardiex Limited's subsidiary, CONNEQT Health, with Apple Health. This integration aligns with broader market trends where tech stocks led indices higher amid President Trump’s tariff exemption for electronics, which added a positive sentiment across the tech sector. Apple's integration with CONNEQT Health is a strategic move to enhance its health-focused offerings, adding depth to its ecosystem. The broader tech rally, including a 7% market gain, added support to Apple's robust performance, painting a positive picture for the week.\nApple has 1 weakness we think you should know about.\nTrump has pledged to \"unleash\" American oil and gas and these 20 US stocks have developments that are poised to benefit.\nThe integration of CONNEQT Health with Apple Health potentially enhances Apple's narrative by reinforcing its expansion in health-focused services. This move aligns with anticipated growth across Apple's Services and AI-driven offerings, suggesting a potential rise in earnings and margins as new users are attracted to the upgraded ecosystem. Over the past five years, Apple's total return was 201.35%, highlighting its impressive performance over a longer period. In comparison, Apple outperformed the US Tech industry with a 14.4% return over the last year.\nThe recent share price increase puts it closer to the consensus analyst price target of US$238.01, providing context for investors considering Apple's growth trajectory. With revenue currently at US$395.76 billion and projected to reach US$479.7 billion by 2028, the integration could bolster these figures by driving further customer engagement and sales, especially in emerging markets like India. The anticipated growth in earnings to US$134.3 billion complements the positive sentiment, although risks such as reliance on China and FX headwinds remain considerations.\nExamine Apple's past performance report to understand how it has performed in prior years.\nThis article by Simply Wall St is general in nature.We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice.It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article includeNasdaqGS:AAPL.\nHave feedback on this article? Concerned about the content?Get in touchwith us directly.Alternatively, emaileditorial-team@simplywallst.com"
    },
    {
        "titulo": "Apple Inc. (AAPL): Exempt from Tariffs, But Concerns Remain",
        "fecha": "Tue, Apr 15, 2025, 1:06 PM",
        "url": "https://finance.yahoo.com/news/apple-inc-aapl-exempt-tariffs-170643504.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks to watch amid market volatility.\nThe uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks related to artificial intelligence. Despite the continued buzz around the technology, no one seems interested in buying the falling stocks. Fluctuating tariff policies from the Trump administration have concerned Wall Street and disrupted global supply chains. The cost of AI infrastructure has increased drastically, especially for companies relying on imported components.\nREAD ALSO:14 AI Stocks Catching Wall Street’s Attentionand9 Trending AI Stocks Making Headlines Today.\nThe narrative around AI stocks has also begun to change because investors are critiquing that prices have become too expensive, and because there is intensifying competition from Chinese companies developing their own AI offerings.\nIn the latest news, seven Republican U.S. senators have also sent a letter to U.S. Commerce Secretary Howard Lutnick. The letter urges him to get rid of a Biden administration rule that restricts global access to AI chips before it kicks in next month. The letter claims that the AI diffusion rule will deter U.S. leadership in artificial intelligence, which is why it demands an “immediate action” to halt it. The rule is set to take effect on May 15.\n“Every day this rule remains in place, American companies face mounting uncertainty, stalled investments, and the risk of losing critical global partnerships that cannot be easily regained. We urge you to withdraw this rule and propose an alternative that is effective in preventing Communist China from capturing the world market in leading technology without compromising American advantages.”\nIt also noted how the rule puts countries into three tiers, with only 18 nations in the Tier 1 group with the easiest access to American technology. Those in tier 2 have to face “arbitrary purchase limits and a cumbersome licensing process.” Meanwhile, it asserted that Tier 3 countries are already “rightly restricted.”\nFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points  (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Holders: 166\nApple Inc. (NASDAQ:AAPL) is a technology company. On April 14, JPMorgan lowered the firm’s price target on the stock to $245 from $270 and kept an “Overweight” rating on the shares. The firm expressed its relief after Trump recently announced that the reciprocal tariffs will exempt smartphones and PCs. The analyst told investors in a research note how these exemptions will help investors refocus on the company’s medium-term drivers. Regardless, “several concerns” remain from the developments over the last two weeks that will inhibit these very investors from turning to a bull case for Apple stock. The firm further announced that semiconductor tariffs are yet to be announced and could impact Apple.\nOverall, AAPLranks 5thon our list of AI stocks to watch amid market volatility. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock.\nREAD NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published atInsider Monkey."
    },
    {
        "titulo": "Magnificent Seven Stocks: Nvidia, Tesla Rally; Google, Amazon Slide",
        "fecha": "Tue, Apr 15, 2025, 12:13 PM",
        "url": "https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks-.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe Magnificent Seven stocks rose Tuesday, as Nvidia and Tesla rallied. Amazon and Google dropped on the stock market today."
    },
    {
        "titulo": "Breaking News: Apple Foldable iPhone Will Feature Only Samsung OLEDs",
        "fecha": "Tue, Apr 15, 2025, 12:07 PM",
        "url": "https://finance.yahoo.com/news/breaking-news-apple-foldable-iphone-160742680.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApril 15- Apple (NASDAQ:AAPL) has reportedly chosenSamsung Displayas the exclusive supplier of OLED screens for its first foldable iPhone, expected to debut in the second half of 2025.\nThe move sidelines competitors such as LG Display and China's BOE, highlighting Samsung Electronics' (SSNLF) dominance in foldable OLED tech. Samsung's ability to minimize screen creasesa key flaw in current foldableswas said to be a major factor in the decision, the report said.\nMass production is expected to begin later this year or in early 2025. The foldable device is rumored to feature a 7.8-inch internal OLED screen, similar in size to the iPad Mini, and a 5.5-inch external display. The price could land near $2,000, putting it in direct competition with Samsung's own Galaxy Z Fold.\nThe production volume is still under discussion, but industry insiders suggest Apple may exceed its initial target of 9 million units, potentially reaching over 15 million.\nThe deal could help Samsung make up for its loss of foldable OLED market share last year that dropped to around 40% and reach 70% in 2025 as demand for the technology soars and competition dwindles, analysts say.\nThis article first appeared onGuruFocus."
    },
    {
        "titulo": "Report: Apple Picks Samsung as Sole OLED Supplier for First Foldable iPhone",
        "fecha": "Tue, Apr 15, 2025, 11:48 AM",
        "url": "https://finance.yahoo.com/news/report-apple-picks-samsung-sole-154809126.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL,Financials) isgearing up to launchits first foldable iPhone in the second half of 2026, and it's turning to a familiar rival for help. The company has selected Samsung Display as the exclusive supplier of OLED panels for the device, marking a rare shift from its usual multi-supplier strategy.\nIndustry sources say Apple chose Samsung for its proven ability to reduce screen creasesa crucial issue for foldable phones. The panels will likely resemble those used in the iPad Mini, with a 7.8-inch internal screen and a 5.5-inch external display. Pricing is expected to start around $2,000, putting it head-to-head with Samsung's own Galaxy Z Fold lineup.\nSamsung Display is expected to start deliveries by late 2025 or early 2026. The exclusive contract could help the company reclaim lost ground in the foldable OLED market, where its share had dropped to about 40% last year. Analysts now expect that number to climb back toward 70% in 2026, boosted by Apple's order.\nInitial projections put the foldable iPhone's annual production at 9 million units, but some forecasts now see it surpassing 15 million. That kind of volume could breathe new life into the sluggish foldable segment, which saw just 2.9% growth last year, according to Counterpoint Research.\nThe move is also seen as a strategic signal from Appleit's placing quality above price and taking a careful but deliberate step into a new product category. Details like the phone's final design or name haven't been confirmed yet, but its success could shape Apple's future in foldable devices, including iPads and laptops.\nThis article first appeared onGuruFocus."
    },
    {
        "titulo": "AAPL “Looks Pretty Good Overall,” LikeFolio Co-Founder Says",
        "fecha": "Tue, Apr 15, 2025, 11:33 AM",
        "url": "https://finance.yahoo.com/news/aapl-looks-pretty-good-overall-153335733.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\n\"Apple (AAPL) continues to dominate\" when it comes to serving and exciting customers, Andy Swan, the co-founder of LikeFolio told Schwab Network recently.\nSwan predicted that the tech giant would launch \"an incredible consumer product within the next couple of years,\" adding that \"we're very bullish on Apple over the long term.\"\nA wide view of an Apple store, showing the range of products the company offers.\nSigns of Strength for Apple\nIn the area of year-over-year increases in internet searches by consumers, \"the iPhone is surging, and the iPad, MacBook, and Air Pods are all doing very well,\" Swan reported.\nMeanwhile, MacBook is benefiting from the Vibe coding trend that was triggered by the proliferation of AI, and AAPL \"is doing a great job of continuing to hold and advance its market share versus Android in most places,\" Swan reported.\nAlso importantly, Apple \"is doing a phenomenal job of integrating AI technology in a smart, sustainable way,\" he stated.\nThe Recent Price Action of AAPL Stock\nIn the last month, the stock has dropped 5%, while it's down 13% in the last three months. Over the last 12 months, however, the shares are up 20%.\nWhile we acknowledge the potential of AAPL, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock.\nREAD NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "titulo": "Trump Trade: Smartphones, computers, chips get break from highest tariffs",
        "fecha": "Tue, Apr 15, 2025, 7:15 PM",
        "url": "https://finance.yahoo.com/news/trump-trade-smartphones-computers-chips-151512534.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nCatch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of PresidentDonald Trumpwith this daily recap compiled by The Fly:\nDiscover outperforming stocks and invest smarter withTop Smart Score Stocks.\nFilter, analyze, and streamline your search for investment opportunities usingTipranks' Stock Screener.\nTARIFFEXEMPTION:According tonew guidancefrom U.S. Customs and Border Protection, PresidentTrumphas exempted smartphones, computers, and other electronic devices and components, including semiconductors, solar cells, flat panel TV displays, flash drives, and memory cards from the reciprocal tariffs imposed on China. White House deputy press secretary Kush Desai said in a statement that Trump “has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops.” Desai added, “At the direction of the President, these companies are hustling to onshore their manufacturing in the United States as soon as possible.” Dan Ives, head of technology research at Wedbush, told CNBC, “This is the dream scenario for tech investors. Smartphones, chips being excluded is a game changer scenario when it comes to China tariffs.”\nPresident Donald Trump stated in a Truth Socialpost, “NOBODY is getting ‘off the hook’ for the unfair Trade Balances, and Non Monetary Tariff Barriers, that other Countries have used against us, especially not China which, by far, treats us the worst! There was no Tariff ‘exception’ announced on Friday. These products are subject to the existing 20% Fentanyl Tariffs, and they are just moving to a different Tariff ‘bucket.’ The Fake News knows this, but refuses to report it. We are taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Security Tariff Investigations. What has been exposed is that we need to make products in the United States, and that we will not be held hostage by other Countries, especially hostile trading Nations like China, which will do everything within its power to disrespect the American People. We also cannot let them continue to abuse us on Trade, like they have for decades, THOSE DAYS ARE OVER! The Golden Age of America, which includes the upcoming Tax and Regulation Cuts, a substantial amount of which was just approved by the House and Senate, will mean more and better paying Jobs, making products in our Nation, and treating other Countries, in particular China, the same way they have treated us.”\nBIG RELIEF:JPMorgan lowered the firm’s price target on Apple(AAPL) to $245 from $270 but kept an Overweight rating on the shares, saying the latest updates from the Trump administration late on Friday, exempting smartphones and PCs from reciprocal tariffs, is a “big relief” for Apple. While the exemption will help return investor focus back to some of the company’s medium-term drivers, “several concerns” remain from the developments over the last two weeks, the firm tells investors in a research note. JPMorgan thinks these will “limit investors from immediately turning to any bull case” for Apple.Semiconductortariffs are still to be announced and could impact Apple, adds the firm. JPMorgan updated its estimates for lower demand from the macro slowdown and potential further downside risk on the resumption of tariffs. It forecasts slowing demand from fiscal Q4 into fiscal 2026 and revised its fiscal 2026 and 2027 iPhone volume expectations to 232M and 242M, respectively, from 249M and 255M units prior.\nDEPORTATION EFFORTS:Prison operatorGeoGroup(GEO)has built a lucrative side business of digital tools to surveil immigrants on behalf of the federal government over the last decade, making it one of the Trump administration’s big business winners amid deportations, the New York Times’ Paul Mozur, Adam Satariano and Aaron Krolikreport, citing legal aid groups and immigration organizations. The company’s ankle monitors, smart watches and tracking apps are aiding the government by providing the locations of unauthorized immigrants to Immigration and Customs Enforcement and legal groups estimate the number of arrests made from the digital monitoring programs is at least in the hundreds.\nU.S. STEEL:U.S President Donald Trump reaffirmed that he does not believe a foreign company should control U.S. Steel(X), following similar comments he made regarding the $15B takeover bid by Japan’s Nippon Steel(NPSCY), Reuters’ Jeff Mason and Kantaro Komiyareport, citing remarks Trump made to reporters. On Wednesday, Trump stated that he didn’t want to see the company “go to Japan” causing a 7% drop in the company’s stock value. Following the comment, both companies stated they were collaborating with the administration “to secure a significant investment”, however on Sunday, Trump affirmed his stance, saying, “I don’t think a foreign company should control U.S. Steel.”\nPublished first onTheFly– the ultimate source for real-time, market-moving breaking financial news.Try Now>>\nSee today’s best-performing stocks on TipRanks >>\nRead More on AAPL:\nDisclaimer & DisclosureReport an Issue\nApple upgraded, Wayfair downgraded: Wall Street’s top analyst calls\nUnusually active option classes on open April 14th\nApple price target lowered to $230 from $290 at DA Davidson\nMorning Movers: Goldman Sachs gains following first quarter results\nNotable open interest changes for April 14th"
    },
    {
        "titulo": "Watch These Apple Price Levels After Gains on Tech Tariff Exemptions",
        "fecha": "Tue, Apr 15, 2025, 11:14 AM",
        "url": "https://finance.yahoo.com/news/watch-apple-price-levels-gains-151415040.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\n\nApple shares wavered between gains and losses in early trading Tuesday after posting gains Monday on the Trump administration’s decision to temporarily exempt many electronic goods from import tariffs.\nThe stock has possibly completed an Elliott Wave pattern with five distinct price swings after which sentiment typically shifts.\nInvestors should watch crucial support levels on Apple's chart around $183 and $169, while also monitoring resistance levels near $220 and $247.\n\nApple (AAPL) shares wavered between gains and losses in early trading Tuesday after posting gains Monday on the Trump administration’s decision totemporarily exempt many electronic goods from import tariffs.\nApple, which assembles a majority of its devices in China, has seen its stock come under considerable pressure in recent weeks amid an intensifying trade war between Washington and Beijing that has resulted inescalating tit-for-tat tariffs, prompting concerns that increasing manufacturing costs could weigh on consumer demand.\nThe iPhone maker’s shares rebounded 5% last week but have lost about a fifth of their value since the start of the year. By comparison, theS&P 500jumped 6% last week and is down about 8% for the year so far.\nBelow, we break down thetechnicalson Apple’s chart and point out crucial price levels worth watching.\nAfter setting theirrecord highin late December, Apple shares have trended lower, possibly completing anElliott Wavepattern, with five distinct price swings after which sentiment typically shifts.\nThe stock appeared to gain momentum in recent trading sessions following last Wednesday’srecord-breaking relief rallythat saw the stock log its largest one-day gain in nearly three decades.\nThe shares have recorded above-averagevolumesince President Trump announced sweeping tariffs earlier this month, signaling increased trading activity as market participants position for further news-driven price swings.\nLet’s identify crucialsupport and resistancelevels on Apple’s chart that could grab investors’ attention.\nA loss of momentum in the stock could see the shares initially fall to around $183. This area on the chart may provide support near ahorizontal linethat connects a range ofprice actionstretching back to January last year.\nSelling below this level opens the door for a retest of lower support at $169. Investors may look to scoop up shares in this region near last week’s low, which also closely aligns with a period ofsideways drifton the chart throughout March and April last year.\nFurther buying this week could see the shares touch overhead resistance around $220. Tactical traders who haveaccumulated sharesat lower levels may decide tolock in profitsin this region near a trendline that links last June’s prominentpeakwith several troughs spanning from July to January.\nFinally, abreakoutabove this area could trigger a move to the $247 level. Apple shares may attract overhead selling pressure in this location near the notable late Februaryswing highand an array of price points positioned just beneath the stock’s record high.\nThe comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read ourwarranty and liability disclaimerfor more info.\nAs of the date this article was written, the author does not own any of the above securities.\nRead the original article onInvestopedia"
    },
    {
        "titulo": "Apple Intelligence, New Form Factors Will Boost AAPL Stock, Analyst Says",
        "fecha": "Tue, Apr 15, 2025, 10:52 AM",
        "url": "https://finance.yahoo.com/news/apple-intelligence-form-factors-boost-145221145.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL) will effectively develop Apple Intelligence, while \"new form factors\" will boost the tech giant's 2026 revenue, Angelo Zino, a senior equity analyst at CFRA Research predicted recently on the Schwab Network.\nZino has a $235 price target and a Buy rating on the shares.\nA wide view of an Apple store, showing the range of products the company offers.\nApple's Positive Catalysts\nThe development of Apple Intelligence, which will become \"more accessible\" in China, will enable the demand for the iPhone 17 to be strong,  Zino asserted. Further, \"new form factors\" that will be launched by the firm, such as foldables, will boost its revenue in 2026, according to the analyst.\nTurning to Services, Zino predicts that the business will continue to grow at an annual rate of about 9%, providing another positive catalyst for AAPL stock.\nApple \"Can Work With\" the Tariffs, Zino Says\nApple is likely to end up with \"a blended tariff\" of 10%-30% on its products, based on the combination of hardware that it will import from China and India, Zino estimated. At those levels, the company can increase its prices \"moderately,\" preventing both \"meaningful demand destruction\" and significant gross margin declines, the analyst predicted.\nWhile we acknowledge the potential of AAPL, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about thischeapest AI stock.\nREAD NEXT:20 Best AI Stocks To Buy Nowand30 Best Stocks to Buy Now According to Billionaires\nDisclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "titulo": "Apple airlifted iPhones worth a record $2 billion from India in March as Trump tariffs loomed",
        "fecha": "Tue, Apr 15, 2025, 10:44 AM",
        "url": "https://finance.yahoo.com/news/apple-airlifted-iphones-worth-record-144418337.html",
        "contenido": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Aditya Kalra and Munsif Vengattil\nNEW DELHI (Reuters) - Apple's main India suppliers Foxconn and Tata shipped nearly $2 billion worth of iPhones to the United States in March, an all-time high, as the U.S. company airlifted devices to bypass President Donald Trump's impending tariffs, customs data shows.\nThe smartphone maker stepped up production in India and chartered cargo flights to ferry 600 tons of iPhones to the United States to ensure sufficient inventory in one of its biggest markets on concern Trump's tariffs would push up costs.\nIn April, the U.S. administration imposed 26% duties on imports from India, much lower than the more than 100% China was facing at the time. Trump has since paused most duties, except for China for three months.\nFoxconn, Apple's main India supplier, exported smartphones worth $1.31 billion in March, its highest ever for a single month and equal to shipments for January and February combined, according to commercially available customs data reviewed by Reuters.\nThis included Apple iPhone 13, 14, 16 and 16e models, and took Foxconn's total shipments from India to the United States this year to $5.3 billion.\nExports from Tata Electronics, another Apple supplier, stood at $612 million in March, around 63% higher than the previous month, and included iPhone 15 and 16 models.\nApple, Foxconn and Tata did not immediately respond to requests for comment. Reuters is the first to report the shipment details.\nCustoms data showed all Foxconn shipments to the United States in March were by air from the Chennai Air Cargo terminal, and landed at various locations, including Los Angeles and New York, with Chicago receiving the majority.\nTrump later granted exclusions from steep tariffs on smartphones and some other electronics imported largely from China, but later indicated that those exemptions will likely be short-lived.\nTo expedite shipments, Apple lobbied Indian airport authorities to cut the time needed to clear customs at Chennai airport in the southern state of Tamil Nadu, to six hours down from 30 hours.\nAt least six cargo jets were used in the operation which one source described was a way to \"beat the tariffs\".\n(Reporting by Aditya Kalra and Munsif Vengattil; Editing by Sharon Singleton)"
    }
]